{
  "backend/main.mo": "Motoko canister storing contact inquiries, providing submission, retrieval, and timestamp-based sorting APIs.",
  "feature_evidence.json": "Feature evidence report mapping high-level website features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend components, sections, hooks, and utilities.",
  "frontend/index.css": "Tailwind base/theme configuration defining OKLCH color tokens, light/dark variables, and global styles.",
  "frontend/index.html": "HTML entry point declaring SEO meta tags, favicon, Open Graph data, and mounting the React app.",
  "frontend/src/App.tsx": "Root React component composing site sections, header/footer, WhatsApp button, and default SEO setup.",
  "frontend/src/components/ContactForm.tsx": "Validated contact form component that submits inquiries to the backend and shows toast feedback.",
  "frontend/src/components/LazyGoogleMapEmbed.tsx": "Interactive map embed that loads a Google Maps iframe only after user action to improve performance.",
  "frontend/src/components/SiteFooter.tsx": "Footer with brand details, quick navigation links, contact info, and social media icons.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo, navigation links, mobile toggle, and smooth scrolling behavior.",
  "frontend/src/components/StickyWhatsAppButton.tsx": "Floating WhatsApp button for mobile that links to a prebuilt chat URL.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity and refreshes queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook for managing authentication state, login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Hook for fetching contact info from the backend actor using React Query.",
  "frontend/src/hooks/useSubmitContactInquiry.ts": "Hook to submit contact form data through the backend actor with submission state tracking.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/src/lib/contactLinks.ts": "Utility for generating phone and WhatsApp links with optional encoded messages.",
  "frontend/src/lib/scroll.ts": "Smooth-scroll helper that offsets scrolling to account for the fixed header.",
  "frontend/src/lib/seo.ts": "Functions to update document title and meta tags for SEO and Open Graph content.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity provider, and global styles.",
  "frontend/src/sections/AboutSection.tsx": "About section layout presenting mission, vision, and teaching methodology with styled cards.",
  "frontend/src/sections/ContactSection.tsx": "Renders the contact section with address, phone/WhatsApp links, office hours, a contact form, and a Google Map embed using styled cards and icons.",
  "frontend/src/sections/CoursesSection.tsx": "Displays board and competitive foundation course cards with icons, color themes, and descriptions, along with headings and supporting text.",
  "frontend/src/sections/HomeSection.tsx": "Builds the hero area, CTA buttons, feature highlights, and course previews for the homepage using icons, gradients, and responsive layout.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, themes, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Stores project metadata including requirements, features, architectural notes, image needs, and overall site goals."
}